Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་གངས་ཀྱི་རིའི་རྒྱལ་པོ་ལ་སྨན་གྱི་རྒྱལ་པོ་ཆེན་པོ་འབྲལ་བར་བྱེད་པ་ཞེས་བྱ་ཞིག་ཡོད་དེ། དེའི་དྲིས་དུག་གི་དྲག་ཤུལ་ཐམས་ཅད་ལས་རབ་ཏུ་ཐར་པར་འགྱུར་ཏེ། དཔག་ཚད་བརྒྱ་ཙམ་ན་འཁོད་པ་དག་ཀྱང་དུག་མེད་པར་འགྱུར་རོ། ཤཱ་རིའི་བུ་གལ་ཏེ་དུད་དམ་རྡལ་སྨན་གྱི་རྒྱལ་པོ་ཆེན་པོ་འབྲལ་བར་བྱེད་པས་བསྐུས་ཏེ་བུས་སམ། བརྡུངས་ན་སེམས་ཅན་དུག་འཐུངས་པ་འམ། ཟོས་པ་འམ། བསྐུས་པས་ཟུག་པར་གྱུར་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དེའི་སྒྲ་ཐོས་ནས་ ནི་དུག་མེད་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་གང་སྨན་གྱི་རྒྱལ་པོ་འབྲལ་བར་བྱེད་པ། དེ་ལྟ་བུ་དེ་ནི་སྨན་པའི་རྒྱལ་པོ་གསོ་བྱེད་མ་གཏོགས་པར་སྨན་པ་ཐམས་ཅད་ཀྱིས་མི་ཤེས་སོ། །
en: “Śāriputra, consider the example of the great king of medicine by the name of Vigama who resides on Himavat, the king of mountains, and whose fragrant substance can overcome any poison and decontaminate an area of up to one hundred yojanas. Now, Śāriputra, if Vigama, the great king of medicine, were to infuse a conch or a drum with his fragrant substance and then make a sound with it, any sentient being who consumes or comes into contact with poison would have the effects of the poison neutralized when they heard this sound. Śāriputra, no other doctor’s knowledge can compare to that of Vigama, the king of medical remedies, except for that of the great king of physicians Jīvaka.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་ལ་མཁས་པ་སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་ཐམས་ཅད་བསལ་པ་མ་གཏོགས་པར་གང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་མེད་པ་དེ་འདྲ་བའི་ཆོས་ཀྱི་སྨན་དང་། །རྩིས་བསྐུ་བའི་སྦྱོར་བ་སྡུད་པར་བྱེད་དེ ཆོས་ཀྱི་སྨན་དང་རྩི་བསྐུ་བའི་སྦྱོར་བ་དེས་ཆོས་ཀྱི་དུང་ཆེན་པོ་ལ་བསྐུས་ནས་ཡོངས་སུ་སྒྲོག་སྟེ། དེའི་སྒྲས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་མངོན་པར་གོ་བར་བྱེད་དོ། ། དེ་ནས་སེམས་ཅན་དུ་མས་དེ་ཐོས་ནས་འདོད་ཆགས་ཀྱི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་འགྱུར། ཞེ་སྡང་དང་། །གཏི་མུག་གི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་འགྱུར། སེམས་ཅན་དུ་མ། སེམས་ཅན་བརྒྱ་ཕྲག་དུ་མ། སེམས་ཅན་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་བརྒྱ་སྟོང་ཕྲག་དུ་མ། །སེམས་ཅན་བྱེ་བ་ཕྲག་དུ་མ། །སེམས་ཅན་བྱེ་བ་བརྒྱ་ཕྲག་དུ་མ། །སེམས་ཅན་བྱེ་བ་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་དཀྲིགས་ཕྲག་དུ་མས་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སེམས་ཅན་རྣམས་ཀྱི་སྒྲ་དེ་ཐོས་ནས་འདོད་ཆགས་ཀྱི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་འགྱུར།
en: “In the same way, Śāriputra, bodhisatvas, great beings, obtain a kind of medicine, a healing balm of the Dharma, that is not available to any śrāvaka or pratyekabuddha. It is the perfect skill in the Dharma of the tathāgatas, the great kings of physicians, and it removes all the ailments of all sentient beings. When one applies this medicine, this healing balm of the Dharma, to the great conch of the Dharma, it fills it up, and its melody resounds throughout the threefold thousand great thousand worlds, alleviating the great diseases of desire, anger, and confusion in the many sentient beings who hear its sound, alleviating the great diseases of desire, anger, and confusion in the sentient beings who happen to hear it, in many hundreds of sentient beings, in many thousands of sentient beings, in many hundreds of thousands of sentient beings, in many tens of millions of sentient beings, in many billions of sentient beings, in many tens of billions of sentient beings, in many trillions of sentient beings, in many millions of trillions of sentient beings, and so forth—in so many sentient beings that it cannot be put into words.

source: ཞེ་སྡང་དང་། གཏི་མུག་གི་ནད་ཆེན་པོ་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། ། དེ་གང་ནས་སྡུད་པར་བྱེད་ཅེ་ན། གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ནོར་བཞག་པ་ནས་སོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེའི་ནོར་གང་དུ་བཞག་ཅེ་ན། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ལས་གུད་ན་མ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་མ་ཉམས་པ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱོད་པ་ན། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་རབ་ཏུ་ཉན་ཏོ། ། འཛིན་ཏོ། ། འཆང་ངོ་། ། ཀློག་གོ ། ཀུན་ཆུབ་པར་བྱེད་དོ། །གཞན་ལ་ཡང་འཆད་ཅིང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: “Where does it come from? It comes from the place where the treasure of the bodhisatva has been deposited. Where has the treasure of the bodhisatva been deposited? It is only found within the cycle of teachings contained in The Collected Teachings on the Bodhisatva. This cycle of teachings contained in The Collected Teachings on the Bodhisatva is what the bodhisatva, the great being, who practices the perfection of vigor will listen to intently. He will memorize it, preserve it, recite it, absorb it, elucidate it for others, and teach it in great detail. This, Śāriputra, is why the bodhisatva, the great being who practices the perfection of vigor, will listen intently to the cycle of teachings contained in The Collected Teachings on the Bodhisatva and why he will memorize it, preserve it, recite it, absorb it, elucidate it for others, and teach it in great detail.

source: ཤཱ་རིའི་བུ་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་མ་ཉམས་པ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་ཉན་པར་བྱེད། འཛིན་པར་བྱེད། འཆང་བར་བྱེད། ཀློག་པར་བྱེད། ཀུན་ཆུབ་པར་བྱེད། གཞན་དག་ལ་ཡང་འཆད་ཅིང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་སྟོན་ཏོ། །
en: “Śāriputra, this point should be taken to heart, that the bodhisatva, the great being, who practices the perfection of vigor listens intently to the cycle of teachings contained in The Collected Teachings on the Bodhisatva and memorizes it, preserves it, recites it, absorbs it, elucidates it to others, and teaches it in great detail.

source: ཤཱ་རིའི་བུ་དེ་བས་ན་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བརྩོན་འགྲུས་མ་ཉམས་པ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཉན་པར་བྱེད། འཛིན་པར་བྱེད། འཆང་བར་བྱེད། ཀློག་པར་བྱེད། ཀུན་ཆུབ་པར་བྱེད། གཞན་དག་ལ་ཡང་འཆད་ཅིང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བྱེད་དོ། ། ཡང་ཤཱ་རིའི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་བ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ། ཡངས་པ། དཔག་ཏུ་མེད་པའི་ཕ་རོལ་གྱི་ཡང་ཤིན་ཏུ་ཕ་རོལ་ཏུ་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་བླ་མ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དུའོ། །ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་བླ་མ་དེ་འདི་ལྟ་སྟེ། ཉན་ཐོས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུའི་ཉན་ཐོས་འདུས་པ་ཆེན་པོ་གཅིག་ཏུ་བྱུང་སྟེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ་ནས་སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་གོ ། ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་བླ་མ་དེའི་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲི་ཐུབ་པར་གྱུར་ཏོ། ། ཤཱ་རིའི་བུ་པད་མའི་བླ་མ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་ལོ་ལྔ་བརྒྱའི་བར་དུ་གནས་སོ། ། ལོ་ལྔ་བརྒྱའི་བར་དུ་ཡང་དམ་པའི་ཆོས་ཀྱི་གཟུགས་བརྙན་གནས་སོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་བླ་མ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་རིང་བསྲེལ་ཡང་རྒྱས་པར་གྱུར་ཏེ། དེ་འདི་ལྟ་སྟེ་དཔེར་ན་དང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་རིང་བསྲེལ་རྒྱས་པར་འགྱུར་བ་བཞིན་ནོ། །
en: “At one time in the past, Śāriputra, a great many uncountable, innumerable, vast, inconceivable eons ago, and much more than that, a tathāgata, arhat, fully accomplished buddha by the name of Padmottara appeared in the world, and so forth. He was awakened, a lord. Śāriputra, the Lord Padmottara, the tathāgata, the arhat, the fully accomplished Buddha, had a great following of śrāvakas. They numbered eight hundred million, and they were all arhats who had eliminated the defilements, who were free from vices, who were powerful, and so forth, and who had reached the very highest level of complete mastery of the mind. Śāriputra, the Lord, the Tathāgata Padmottara lived until he was eighty years old, and then, after Padmottara passed away, his true Dharma remained for five hundred years. For another five hundred years a reflection of the true Dharma remained. Moreover, Śāriputra, after the tathāgata, arhat, fully accomplished Buddha Padmottara passed away, his remains were distributed, just as my remains will be distributed when I pass away.

source: ཤཱ་རིའི་བུ་དེའི་ཚེ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་བླ་མ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ ལོ་བརྒྱ་ལོན་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་ཅིག་འཇིག་རྟེན་གྱི་ཁམས་གཞན་ཞིག་ནས་ཤི་འཕོས་ཏེ། དེའི་གསུང་རབ་ལ་རྒྱལ་རིགས་སུ་སྐྱེས་པར་གྱུར་ཏེ། དེ་བཙས་མ་ཐག་ཏུ་བདག་ནི་ཆོས་སྤྱོད་པའི་རིགས་སུ་སྐྱེས་ཀྱིས་བདག་གིས་ཆོས་སྤྱད་པར་བྱའོ་ཞེས་ཚིག་དེ་སྐད་སྨྲས་ཏེ། དེའི་མིང་ཆོས་སྤྱོད་ཅེས་བཏགས་སོ། །
en: “Then, Śāriputra, a hundred years after the final nirvāṇa of the Lord, the Tathāgata Padmottara, a bodhisatva died in another world and was, as foretold, reborn in a royal family. Immediately after his birth, he proclaimed, ‘We have been reborn in an un-Dharmic family, so we must go in search of the Dharma.’ Because of this, he was given the name Dharmacārin.

source: ཤཱ་རིའི་བུ་དེ་ནས་རྒྱལ་བུ་ཆོས་སྤྱོད་དབང་པོ་ཡོངས་སུ་སྨིན་པའི་རྒྱུས་སྐྱེས་ནས་ལོ་ཉི་ཤུ་ལོན་པ་དང་འདྲ་བ་དེ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་སྟེ། དགོན་པ་ནགས་ཚལ་ན་གནས་བས་མཐའི་གནས་མལ་དུ་གནས་སོ། ། དེ་གཅིག་ཏུ་དབེན་པར་སོང་སྟེ། ནང་དུ་ཡང་དག་པར་འཇོག་པ་ན་ལྷ་ཞིག་འོངས་ནས། དགེ་སློང་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྒྲ་རྣམ་པར་གྲགས་པར་འགྱུར་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ལ་བརྩོན་པར་གྱིས་ཤིག །མ་ཐོབ་པར་བརྩོན་འགྲུས་ཉམས་པར་མ་བྱེད་ཅིག་ཅེས་དོན་དེ་བསྟན་པ་དང་། དེས་ལྷ་དེ་ལས་ཚིག་དེ་ཐོས་ནས་ དགའ་མགུ་ཡི་རངས་རབ་ཏུ་དགའ་སྟེ་ དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དང་། ལྗོངས་ནས་ལྗོངས་སུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀུན་ཏུ་ཚོལ་ཞིང་རྗེས་སུ་སྤྱོད་དེ དེ་གང་དང་གང་དུ་དགེ་འདུན་གྱི་ཀུན་དགའ་ར་བར་དགེ་སློང་ཕ་དང་། དགེ་སློང་མ་མཐོང་བ་དང་། དེ་དག་གི་གན་དུ་སོང་ནས་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔས་གང་ལ་བསླབས་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱིས་འབྱུང་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་གང་ལགས་ཞེས་དྲིས་པ་དང་།
en: “Śāriputra, when the prince Dharmacārin’s faculties had ripened and he had reached the age of twenty, he followed his conviction, left ordinary household life behind, and become a renunciant, retreating to forests and keeping to remote dwelling places. While he was in his secluded retreat, gods approached him and encouraged him, saying, ‘You, mendicant, will make the words of the tathāgata, arhat, fully accomplished Buddha resound. You should pursue the cycle of teachings contained in The Collected Teachings on the Bodhisatva, and as long as you have not found it you should not let your vigor wane.’ When he heard what these gods said, he was greatly delighted, pleased, and inspired, and he enthusiastically went in search of the cycle of teachings contained in The Collected Teachings on the Bodhisatva. He passed through villages, towns, cities, countries, kingdoms, and royal courts, going from settlement to settlement, searching everywhere for the places where the Saṅgha was dwelling, approaching male and female mendicants and asking them, ‘Do you know of the cycle of teachings that is studied by the noble bodhisatvas, their resource for the qualities of the Buddha, that is called The Collected Teachings on the Bodhisatva?’

source: དེ་དག་གིས་སྨྲས་པ། དགེ་སློང་བདག་ཅག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ ཅི་འདྲ་བར་མི་ཤེས་ཏེ དགེ་སློང་བདག་ཅག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་མིང་དེང་གདོད་རྣ་བས་ཐོས་སུ་ཟད་དོ་ཞེས་སྨྲས་པ་དང་།
en: “They would answer, ‘Mendicant, we do not know of any cycle of teachings called The Collected Teachings on the Bodhisatva. Mendicant, today is the first time we have heard that there is a cycle of teachings that is called The Collected Teachings on the Bodhisatva.’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ལྷ་ནི་བརྫུན་མི་ཟེར་གྱིས་ཇི་སྲིད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མ་ཐོས་པ་དེ་སྲིད་དུ་བརྩོན་འགྲུས་མ་ཉམས་པར་བྱའོ་སྙམ་ནས།
en: “He thought to himself, ‘The gods did not lie. As long as I have not heard the cycle of teachings contained in The Collected Teachings on the Bodhisatva, I will not let my vigor wane.’

source: དེས་ཚེ་དང་ལྡན་པ་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་བླ་མ་དེ་གང་དུ་ཞུ་གསལ་བཞེན་ཅེས་དྲིས་པ་དང་།
en: “He asked them, ‘Venerable ones, where was it that the Lord, the Tathāgata Padmottara, was cremated?’

source: དེ་དག་གིས་དགེ་སློང་ས་ཕྱོགས་འདིར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་བླ་མ་དེ་ཞུགས་ལ་བཞེན་ཏོ། །
en: “They pointed the spot out to him, saying, ‘Mendicant, this is the spot where the Lord, the Tathāgata Padmottara, was cremated.’

source: ཞེས་ཕྱོགས་དེ་བསྟན་ནས་དེས་ཕྱོགས་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། ས་ཕྱོགས་དེར་བསྐོར་བ་བྱས་ནས་ས་ཕྱོགས་དེ་ཉིད་དུ་ཕྱོགས་གཅིག་ཏུ་འདུག་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་བླ་མ་དེ་མངོན་དུ་བྱས་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཇི་སྲིད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་བླ་མ་དེ་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མངོན་དུ་མ་ཐོས་པ་དེ་སྲིད་དུ་བདག་ས་ཕྱོགས་འདི་ནས་མི་ལྡང་ཞིང་སྐྱིལ་མོ་ཀྲུང་མི་གཞིག་གོ་སྙམ་མོ། །
en: “He went there, and when he arrived at the spot he circumambulated it and then sat down to one side. Facing the Lord, the Tathāgata Padmottara, he then thought, ‘I will not leave this spot, I will not change my posture, until I have heard the cycle of teachings contained in The Collected Teachings on the Bodhisatva directly from the Lord, the Tathāgata Padmottara, himself.’

source: ཤཱ་རིའི་བུ་དེ་ལྟར་རྒྱལ་པོ་དྲང་སྲོང་བརྩོན་འགྲུས་མ་ཉམས་པས་དེ་ལྟ་བུར་དམ་བཅས་པ་བརྟན་པར་བྱས་ནས་ས་ཕྱོགས་དེ་ཉིད་དུ་འདུག་སྟེ། ཞག་བདུན་གྱི་བར་དུ་གནས་སོ། ། དེ་ཞག་བདུན་འདས་པ་དང་། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་བཅུ་པ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་ཞེས་བྱ་བ་བྱོན་ནས་ ཆོས་ཀྱི་སྒོའི་ཚིག་བརྒྱད་པོ་འདི་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཁོང་དུ་ཆུད་པར་བྱའོ། ཞེས་ཆོས་ཀྱི་སྒོའི་ཚིག་བརྒྱད་རྣམས་ཡང་དག་པར་རབ་ཏུ་བསྟན་པ་དང་། དེ་ཆོས་ཀྱི་སྒོའི་ཚིག་བརྒྱད་པོ་དེ་དག་གིས་མང་དུ་ཐོས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བླ་ན་ མེད་པ་དང་ལྡན་པར་གྱུར་ནས་ ས་ཕྱོགས་དེ་ཉིད་ནས་ལངས་ཏེ་སོང་ངོ་། ། བརྩོན་འགྲུས་མ་ཉམས་པ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་སུ་ལོ་དྲུག་ཅུའི་བར་དུ་རྒྱུ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་རབ་ཏུ་བསྟན་ཏོ། །
en: “Śāriputra, so firm was the resolve of the royal sage who possessed unyielding vigor that he remained seated on that spot for seven days. When seven days had passed, the tathāgata, arhat, fully accomplished buddha by the name of Ratnagarbha arrived from the tenth universe to the east to reveal key verses of the Dharma that contained eight syllables to a foot. Through these verses he was able to come to an understanding of the cycle of teachings contained in The Collected Teachings on the Bodhisatva. These key verses of the Dharma that contained eight syllables to a foot brought him inconceivable, unsurpassably great learning. He then rose and left that place. He practiced the perfection of vigor with unyielding vigor and elucidated this very cycle of teachings contained in The Collected Teachings on the Bodhisatva, traveling through villages, towns, cities, countries, kingdoms, and royal courts for sixty years.

source: དེས་ལོ་དྲུག་བཅུའི་བར་དུ་ལྷ་དང་། མིའི་སྲོག་ཆགས་བྱེ་བར་ཚང་བ་སྙེད་ཐེག་པ་གསུམ་དག་ལ་བཀོད་ནས་ འཆི་ཁར་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཉིད་དུ་མི་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་ནས་ དེ་འཆི་བའི་དུས་བྱས་པ་དང་། དེ་འཛམ་བུའི་གླིང་དེ་ཉིད་དུ་ཚོང་དཔོན་གྱི་རིགས་ཤིག་ཏུ་སླར་སྐྱེས་ཏེ། དེ་བཙས་མ་ཐག་ཏུ་ཆོས་སྤྱད་པར་བྱའོ། ། ཆོས་སྤྱད་པར་བྱའོ་ཞེས་ཚིག་དེ་སྐད་སྨྲས་ནས་དེ་སྔ་མ་བཞིན་དུ་མིང་ཆོས་སྤྱོད་ཅེས་བཏགས་སོ། །
en: In the course of these sixty years he established ten million beings, gods and men, in the three vehicles, and when the time of his death arrived, he made the following prayer: ‘May I share the same fate as the human beings in this very buddha realm.’ As he was passing away he said, ‘I am to be reborn yet again in a family of merchants on the Jambu continent.’ Immediately after his birth he spoke these words: ‘I will be a practitioner of the Dharma. I will be a practitioner of the Dharma.’ And so, as before, he was given the name Dharmacārin, ‘practitioner of the Dharma.’

source: དེ་བཙས་ནས་ལོ་དྲུག་ལོན་པ་འདྲ་བ་སྟེ། དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། ། དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་རིང་པོ་མ་ལོན་པར་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མངོན་དུ་གྱུར་ཏོ། ། དེ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ལ་གནས་ནས་ ལོ་དྲུག་ཅུའི་བར་དུ་གྲོང་ནས་གྲོང་དུ། གྲོང་ཁྱེར་ནས་གྲོང་ཁྱེར་དུ། ལྗོངས་ནས་ལྗོངས་སུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅིང་རྒྱུའོ། ། དེས་ལོ་དྲུག་ཅུའི་བར་དུ་ལྷ་དང་མིའི་སྐྱེ་དགུའི་སྲོག་ཆགས་གཞན་བྱེ་བ་འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཐེག་པ་ཆེན་པོ་བླ་ན་མེད་པ་དང་། ཐེག་པ་གསུམ་དག་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: “When he reached the age of six he followed his conviction, left ordinary household life behind, and become a renunciant, and not long after his going forth, the cycle of teachings contained in The Collected Teachings on the Bodhisatva revealed itself to him again. For sixty years he continually proclaimed this very cycle of teachings contained in The Collected Teachings on the Bodhisatva in village after village, town after town, country after country. During these sixty years, another ten million beings, gods and human beings, gained maturity in the three vehicles—the Śrāvakayāna, the Pratyekabuddhayāna, and the unsurpassable Mahāyāna.

source: དེ་ཡང་འཆི་ཀར་མིར་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་པ་དང་། དེ་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་འཛམ་བུའི་གླིང་དེ་ཉིད་དུ་རྒྱལ་རིགས་ཤིག་ཏུ་སླར་སྐྱེས་ཏེ། དེ་བཙས་མ་ཐག་ཏུ་ལྷས་ཀྱེ་མའོ། ། འཇིག་རྟེན་དུ་སེམས་ཅན་ཆོས་ཀྱི་བླ་མ་འདི་སྐྱེས་སོ། ། ཀྱེ་མའོ་འཇིག་རྟེན་དུ་སེམས་ཅན་ཆོས་ཀྱི་བླ་མ་འདི་སྐྱེས་སོ་ཞེས་སྒྲ་ཕྱུང་ནས། དེའི་མིང་ཆོས་ཀྱི་བླ་མ་ཆོས་ཀྱི་བླ་མ་ཞེས་བཏགས་སོ། །
en: “Again, when the time of his death arrived, he made a vow to return as a human being, and through the power of this vow, he was reborn yet again in a royal family on the Jambu continent. Immediately after his birth, these words issued from the heavenly realms: ‘Oh! A being of the unsurpassed Dharma has been born in the world. Ah! A being of the unsurpassed Dharma has been born in the world. Dharmottara, “unsurpassed Dharma,” shall be his name.’

source: དེ་ཡང་དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པའི་རྒྱུས་སྐྱེས་ནས་ལོ་ཉི་ཤུ་ལོན་པ་འདྲ་བ་དེ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། ། དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་ དགེ་སློང་ཆོས་ཀྱི་བླ་མ་དེ་དྲན་པའི་སྟོབས་བསྐྱེད་པ་དང་། ཤེས་རབ་ཀྱི་སྟོབས་བསྐྱེད་པས་སླར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མངོན་དུ་གྱུར་ཏོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་དགེ་སློང་ཆོས་ཀྱི་བླ་མས་ཐེ་ཚོམ་གཅོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ལོ་སྟོང་དྲུག་ཁྲི་ཚང་བར་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་སྣ་ཚོགས་སུ་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ། ། དེ་ལོ་སྟོང་དྲུག་ཁྲིའི་བར་དུ་ལྷ་དང་མིའི་སྐྱེ་དགུའི་སྲོག་ཆགས་གཞན་བྱེ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་ནས་
en: “When he reached maturity, around the age of twenty, he followed his conviction, left ordinary household life behind, and become a renunciant. Having become a renunciant, the mendicant Dharmottara’s power of mindfulness was rekindled, his power of wisdom was rekindled, and again the cycle of teachings contained in The Collected Teachings on the Bodhisatva revealed itself to him. Thereupon, Śāriputra, the mendicant Dharmottara proclaimed the cycle of teachings contained in The Collected Teachings on the Bodhisatva, the cycle of teachings that severs doubt, in various villages, towns, cities, countries, and royal courts for a full sixty thousand years. During those sixty thousand years another ten million beings—gods, humans, and asuras—matured to the stage of unsurpassed perfect awakening.

source: དེ་ཡང་འཆི་ཀར་མིར་སྐྱེ་བར་སྨོན་ལམ་བཏབ་སྟེ དེ་འཆི་བའི་དུས་བྱས་པ་དང་། འཛམ་བུའི་གླིང་དེ་ཉིད་དུ་ཁྱིམ་བདག་གི་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་སླར་སྐྱེས་ཏེ། དེ་བཙས་མ་ཐག་ཏུ་ལྷ་ཞིག་གིས་ཀྱེ་མའོ་འཇིག་རྟེན་དུ་སེམས་ཅན་དྲན་པ་ཐོབ་པ་འདི་སྐྱེས་སོ། ། ཀྱེ་མའོ་འཇིག་རྟེན་དུ་སེམས་ཅན་དྲན་པ་ཐོབ་པ་འདི་སྐྱེས་སོ་ཞེས་སྒྲ་ཕྱུང་ནས་དེའི་མིང་དྲན་པ་ཐོབ་པ་དྲན་པ་ཐོབ་པ་ཞེས་བཏགས་སོ། ། དེ་དབང་པོ་ཡོངས་སུ་སྨིན་པའི་རྒྱུས་སྐྱེས་ནས་
en: “Again, when the time of his death arrived, he made a vow to return as a human being, and after he died he was reborn in a family of householder lords on the Jambu continent. Immediately after his birth, these words issued from the heavenly realms: ‘Ah! A being who has mastered mindfulness has appeared in the world. Ah! A being who has mastered mindfulness has appeared in the world.’ Because of this, he was given the name Smṛtipratilabha, ‘the one who has mastered mindfulness.’

source: ལོ་ཉི་ཤུ་ལོན་པ་འདྲ་བ་དེ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་ དྲན་པ་མ་བརྗེད་པས་མང་དུ་ཐོས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བླ་ན་ མེད་པ་དང་ལྡན་པར་གྱུར་ཏོ། ། དེ་ལོ་དྲུག་ཁྲིའི་བར་དུ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་རྒྱུ་ཞིང་ཆོས་སྟོན་པ་ནི་འདི་ལྟ་སྟེ། ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་ལོ་དྲུག་ཁྲིའི་བར་དུ་ཆོས་སྟོན་ཏེ། དེས་ལོ་དྲུག་ཁྲིའི་བར་དུ་ལྷ་དང་མིའི་སྐྱེ་དགུའི་སྲོག་ཆགས་བྱེ་བ་ཕྲག་བཞི་འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། སངས་རྒྱས་ཀྱི་ཐེག་པ་བླ་ན་མེད་པ་དང་། ཐེག་པ་གསུམ་དག་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་ཆོས་ལ་རྟོན་པའི་དགེ་སློང་དེ་དེ་ནས་ཤི་འཕོས་ཏེ། འཆི་བའི་དུས་བྱས་ནས་ཤར་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེས་སོ། །
en: “When he reached maturity, around the age of twenty, he followed his conviction, left ordinary household life behind, and become a renunciant. Because he did not lose his mindfulness, he went on to accumulate inconceivable, unsurpassed great learning. He taught the Dharma for sixty thousand years, visiting villages, towns, cities, countries, kingdoms, and royal courts. He proclaimed the cycle of teachings contained in The Collected Teachings on the Bodhisatva, which severs all doubts, in villages, towns, cities, countries, kingdoms, and royal courts. During those sixty thousand years, he was responsible for forty million beings—gods, humans, and asuras— reaching maturity by means of the three vehicles: the Śrāvakayāna, the Pratyekabuddhayāna, and the unsurpassed Buddhayāna. Śāriputra, he was a mendicant who relied upon the Dharma, and when the time of his death arrived, he was reborn in the eastern buddha realm of the Tathāgata Ratnagarbha.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའི་ཆེན་པོ་དེས་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་གྱི་སྐྱེ་དགུའི་སྲོག་ཆགས་བྱེ་བ་ཕྲག་དྲུག་ཅུར་ཚང་བ་ཐེག་པ་གསུམ་དག་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་པར་གྱུར་ཏོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེས་མ་ཐག་ཏུ་མང་དུ་ཐོས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བླ་ན་ མེད་པ་དང་ལྡན་པར་གྱུར་ཏོ། ། དེ་དེ་ན་ཚེ་ཇི་ཙམ་ཐུབ་པར་འདུག་ནས་དེ་ནས་ཤི་འཕོས་ཏེ་འཆི་བའི་དུས་བྱས་པ་དང་། དེ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཉིད་དུ་སྐྱེས་ཏེ། གང་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་བླ་མ་བྱུང་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་རྒྱལ་རིགས་སུ་སྐྱེས་སོ། ། སྔོན་ཡོངས་སུ་སྨིན་པར་བྱས་པའི་སྲོག་ཆགས་བྱེ་བ་ཕྲག་དྲུག་ཅུ་པོ་དེ་དག་ཀྱང་དེ་ཉིད་དུ་སྐྱེས་ནས་དེའི་གཡོག་ཏུ་གྱུར་ཏོ། །
en: “Śāriputra, this bodhisatva, this great being, had helped to bring a full sixty million beings—gods, human beings, and asuras—to maturity by means of the three vehicles, and, Śāriputra, as soon as he was born in that buddha realm, he came to possess the inconceivable and unsurpassable great learning of the Tathāgata Ratnagarbha. He remained there for a considerable number of years, and when the time of his death arrived, he was again reborn in a buddha realm, in the world where the Lord, the Tathāgata Padmottara, had appeared, this time in a royal family. Those sixty million beings whom he had previously helped bring to maturity now became his assistants in that rebirth.
